scripts/benchmark-exp-logs/social-network/social-network-no-tracing-benchmark-2-16.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  2 threads and 16 connections
  Thread calibration: mean lat.: 2299.722ms, rate sampling interval: 7512ms
  Thread calibration: mean lat.: 2299.068ms, rate sampling interval: 7516ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.73s   501.32ms   4.72s    64.08%
    Req/Sec     4.82k   109.52     5.00k    66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.76s 
 75.000%    4.12s 
 90.000%    4.37s 
 99.000%    4.72s 
 99.900%    4.88s 
 99.990%    4.96s 
 99.999%    5.01s 
100.000%    5.02s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2283.519     0.000000            1         1.00
    3024.895     0.100000        48556         1.11
    3266.559     0.200000        97185         1.25
    3452.927     0.300000       145275         1.43
    3614.719     0.400000       193901         1.67
    3760.127     0.500000       242452         2.00
    3827.711     0.550000       266778         2.22
    3893.247     0.600000       290543         2.50
    3966.975     0.650000       315375         2.86
    4040.703     0.700000       339263         3.33
    4118.527     0.750000       363558         4.00
    4157.439     0.775000       375419         4.44
    4198.399     0.800000       388011         5.00
    4239.359     0.825000       400314         5.71
    4280.319     0.850000       411936         6.67
    4325.375     0.875000       423839         8.00
    4349.951     0.887500       430184         8.89
    4374.527     0.900000       436318        10.00
    4399.103     0.912500       441939        11.43
    4427.775     0.925000       447903        13.33
    4460.543     0.937500       453986        16.00
    4481.023     0.943750       457353        17.78
    4501.503     0.950000       460338        20.00
    4526.079     0.956250       463322        22.86
    4554.751     0.962500       466309        26.67
    4587.519     0.968750       469233        32.00
    4603.903     0.971875       470585        35.56
    4624.383     0.975000       472239        40.00
    4644.863     0.978125       473918        45.71
    4661.247     0.981250       475245        53.33
    4681.727     0.984375       476830        64.00
    4689.919     0.985938       477452        71.11
    4702.207     0.987500       478310        80.00
    4714.495     0.989062       479106        91.43
    4726.783     0.990625       479856       106.67
    4739.071     0.992188       480552       128.00
    4747.263     0.992969       480956       142.22
    4755.455     0.993750       481320       160.00
    4763.647     0.994531       481643       182.86
    4771.839     0.995313       481930       213.33
    4784.127     0.996094       482293       256.00
    4792.319     0.996484       482497       284.44
    4800.511     0.996875       482671       320.00
    4812.799     0.997266       482892       365.71
    4825.087     0.997656       483082       426.67
    4837.375     0.998047       483249       512.00
    4845.567     0.998242       483351       568.89
    4853.759     0.998437       483447       640.00
    4861.951     0.998633       483537       731.43
    4870.143     0.998828       483617       853.33
    4882.431     0.999023       483721      1024.00
    4890.623     0.999121       483790      1137.78
    4894.719     0.999219       483820      1280.00
    4902.911     0.999316       483883      1462.86
    4907.007     0.999414       483910      1706.67
    4915.199     0.999512       483967      2048.00
    4919.295     0.999561       483993      2275.56
    4923.391     0.999609       484015      2560.00
    4927.487     0.999658       484032      2925.71
    4931.583     0.999707       484054      3413.33
    4935.679     0.999756       484072      4096.00
    4939.775     0.999780       484090      4551.11
    4939.775     0.999805       484090      5120.00
    4943.871     0.999829       484105      5851.43
    4947.967     0.999854       484118      6826.67
    4952.063     0.999878       484127      8192.00
    4956.159     0.999890       484139      9102.22
    4956.159     0.999902       484139     10240.00
    4960.255     0.999915       484143     11702.86
    4968.447     0.999927       484152     13653.33
    4972.543     0.999939       484155     16384.00
    4976.639     0.999945       484157     18204.44
    4984.831     0.999951       484162     20480.00
    4988.927     0.999957       484164     23405.71
    4993.023     0.999963       484167     27306.67
    4997.119     0.999969       484169     32768.00
    5001.215     0.999973       484172     36408.89
    5001.215     0.999976       484172     40960.00
    5005.311     0.999979       484174     46811.43
    5009.407     0.999982       484176     54613.33
    5009.407     0.999985       484176     65536.00
    5013.503     0.999986       484179     72817.78
    5013.503     0.999988       484179     81920.00
    5013.503     0.999989       484179     93622.86
    5013.503     0.999991       484179    109226.67
    5017.599     0.999992       484181    131072.00
    5017.599     0.999993       484181    145635.56
    5017.599     0.999994       484181    163840.00
    5017.599     0.999995       484181    187245.71
    5017.599     0.999995       484181    218453.33
    5021.695     0.999996       484183    262144.00
    5021.695     1.000000       484183          inf
#[Mean    =     3730.150, StdDeviation   =      501.320]
#[Max     =     5017.600, Total count    =       484183]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  584542 requests in 1.00m, 110.94MB read
Requests/sec:   9742.42
Transfer/sec:      1.85MB